# ΠΡΟΓΡΑΜΜΑ ΕΛΕΓΧΟΥ ΑΜΚΑ - ΕΚΤΥΠΩΣΗ ΗΛΙΚΙΑΣ & ΦΥΛΟΥ
# *************************************************
# Το AMKA είναι μία αλφαριθμητική συμβολοσειρά, ένα σύνολο διαδοχικών συμβόλων ενός
# πεπερασμένου σύνολου(αλφάβητου)μεστοιχεια που περιορίζονται σε γράμματα και αριθμούς

## Εναλλακτική λύση με χρήση αρθρώματος (module) - βιβλιοθήκης datetime -
## θα μιλήσουμε για αυτά αργότερα (Αγγελιδάκης Ν- Ενότητα 6.8)

##import datetime
##current_year = datetime.datetime.now().year


current_year = 2022
while True:
    amka = input("Δώστε ΑΜΚΑ:")
    if not amka:  # Με Enter εισάγεται κενή συμβολοσειρά
        print("ΤΕΛΟΣ ΠΡΟΓΡΑΜΜΑΤΟΣ")  # Εμφανίζει μήνυμα ΤΕΛΟΣ ΠΡΟΓΡΑΜΜΑΤΟΣ
        break  # Διακόπτεται η εκτέλεση του προγράμματος
    if not amka.isdigit():
        print("παρακαλώ δώστε αριθμό")
        continue
    if len(amka) != 11:
        print("παρακαλώ δώστε 11 ψηφία")
        continue

    birth_year = int(amka[4:6]) + 2000  # Εκχώρηση ψηφίων έτους γέννησης από το ΑΜΚΑ
    if birth_year > current_year:
        birth_year -= 100  # Έλέγχος για τον αιώνα γέννησης
    print(f"ο/η κάτοχος είναι {current_year - birth_year} ετών")

    if int(amka[6:10]) % 2:  # Έλεγχος ακεραίου υπολοίπου διαίρεσης με 2 για φύλο
        print("άνδρας")  # άρτιος
    else:
        print("γυναίκα")  # περιττός

    # Ερώτημα για επανάληψη ελέγχου για άλλο AMKA
    if str(input("Θέλετε να ελέγξετε άλλο ΑΜΚΑ, (Ν)αι/(Ο)χι;\n")) == "Ν":
        continue
    else:
        print("ΤΕΛΟΣ ΠΡΟΓΡΑΜΜΑΤΟΣ")
        break  # Διακοπή επανάληψης και τερματισμός προγράμματος
