import pandas as pd # Χρήση της βιβλιοθήκης pandas
import matplotlib.pyplot as plt # Χρήση της βιβλιοθήκης matplotlib.pyplot

def printMeteoData(file,city):
    '''Ανάγνωση μετεωρολογικών δεδομένων, για μια πόλη, και εκτύπωσή τους'''
    # Υποερώτημα α
    # Ανάγνωση με την pandas του φύλλου για την πόλη σε ένα dataframe

    # Εκτύπωση του dataframe με τα στοιχεία της πόλης



def printMeteoStats(file,metric,city):
    '''Ανάγνωση μετεωρολογικών δεδομένων, για μια πόλη, και εκτύπωση βασικών στατιστικών στοιχείων μιας μετρικής'''
    # Υποερώτημα β
    # Ανάγνωση με την pandas του φύλλου για την πόλη σε ένα dataframe

    # Υπολογισμός και εκτύπωση μέσης τιμής και οριακών τιμών της μετρικής



def plotMeteoData(file,x_axis,metric,*list_of_cities):
    '''Ανάγνωση μετεωρολογικών δεδομένων και εμφάνιση συγκριτικού γραφήματος μιας μετρικής'''
    # Υποερώτημα γ
    # Επανάληψη για όλες τις πόλεις

        # Ανάγνωση με την pandas του φύλλου για την πόλη σε ένα dataframe

        # Δημιουργία γραφήματος με τα δεδομένα της μετρικής για την πόλη των τριών πόλεων


    # Προσθήκη τίτλου, ετικετών αξόνων και υπομνήματος


    # Εμφάνιση του γραφήματος



# Κυρίως πρόγραμμα

# Ορισμός του αρχείου με τα δεδομένα προς ανάγνωση
excel_file='weatherdata.xlsx'

# Υποερώτημα δ

# Εκτύπωση, με την printMeteoData, των στοιχείων για την Αθήνα

# Εκτύπωση, με την  printMeteoStats, βασικών στατιστικών τιμών θερμοκρασίας
# για τη Θεσσαλονίκη

# Δημιουργία συγκριτικού διαγράμματος για την υγρασία στις τρεις πόλεις


