# Υπολογισμός κόστους παραγγελίας ab βιβλίων
# με κόστος kb και κόστος μεταφοράς km
ab = -1  # αρχικοποίηση αριθμού βιβλίων
kb = -1  # αρχικοποίηση κόστους βιβλίου

# Εισαγωγή αριθμού βιβλίων
# αμυντικός προγραμματισμός ώστε ο αριθμός βιβλίων να είναι θετικός αριθμός
while ab <= 0:
    try:  # χρήση try ως αμυντικός προγραμματισμός για είσοδο
        ab = int(input("Αριθμός βιβλίων: "))
    except ValueError:  # σε περίπτωση με έγκυρης εισόδου
        print("Ο αριθμός βιβλίων δεν είναι θετικός ακέραιος αριθμός.")
# Εισαγωγή κόστους βιβλίου
# αμυντικός προγραμματισμός το κόστος ενός βιβλίου να είναι θετικός αριθμός
while kb <= 0:
    try:  # χρήση try ως αμυντικός προγραμματισμός για είσοδο
        kb = int(input("Κόστος ενός βιβλίου: "))
    except ValueError:  # σε περίπτωση με έγκυρης εισόδου
        print("Ο αριθμός βιβλίων δεν είναι θετικός ακέραιος αριθμός.")
if ab == 1:
    km = 2  # κόστος μεταφοράς ενός βιβλίου
    print("Κόστος παραγγελίας = ", ab * kb * 0.8 + km, "€")
else:
    km = 1  # κόστος μεταφοράς καθενός του επιπλέον του ενός βιβλίου
    print("Κόστος παραγγελίας = ", ab * kb * 0.8 + km * (ab - 1) + 2, "€")
