# Δευτεροβάθμια εξίσωση της μορφής ax^2+bx+c=0
# Εάν a=0 τότε το πρόβλημα απλοποιείται στη λύση της 
# πρωτοβάθμιας εξίσωσης της μορφής bx+c=0
# Εάν a!=0, τότε θα υπολογιστει η διακρίνουσα D=b*b-4*a*c
# και θα ελεγχθούν τρεις περιπτώσεις σύγκρισης της D με το 0

# Εισαγωγή συντελεστών
a = int(input("Δώστε το a: "))
b = int(input("Δώστε το b: "))
c = int(input("Δώστε το c: "))

# Έλεγχος για το a
if a == 0:  # έχουμε την πρωτοβάθμια bx+c=0
    if b != 0:
        x = -c/b
        print("Λύση πρωτοβάθμιας με ρίζα:", x)
    else:
        print("Η εξίσωση είναι αδύνατη")
else:        # πλήρης δευτεροβάθμια
    D = b**2-4*a*c  # υπολογισμός διακρίνουσας
    print("Διακρίνουσα =",D)
    if D == 0: #μία διπλή ρίζα
        x = -b/(2*a)
        print("Μηδενική διακρίνουσα, διπλή ρίζα x =", x)
    else:  # δύο λύσεις (πραγματικές ή μιγαδκές)
        x1=(-b-D**(1/2))/(2*a)  # υπολογισμός τετραγωνικής ρίζας με ύψωση εις την 1/2
        x2=(-b+D**(1/2))/(2*a)
        if D>0:
            print("Θετική διακρίνουσα, δύο πραγματικές λύσεις:", x1, "και", x2)
        else:
            print("Αρνητική διακρίνουσα, δύο Μιγαδικές ρίζες, συζυγείς:", x1, "και", x2)
    
