import random


def generate_random_floats():
    # συνάρτηση που επιστρέφει λίστα n τυχαίων αριθμών στη διάστημα
    # -m, m με σπόρο γεννήτριας ψευδοτυχαίων αριθμών seed (προαιρετικό όρισμα)
    pass


def find_max_gap():
    # συνάρτηση  που δέχεται λίστα πραγματικών αριθμών και επιστρέφει τη
    # μέγιστη απόσταση μεταξύ τους
    pass


def present_list():
    # βοηθητική συνάρτηση που τυπώνει τα στοιχεία μιας λίστας
    pass


### κυρίως πρόγραμμα ###

# ζήτησε από τον χρήστη το πλήθος των τυχαίων αριθμών

# ζήτησε από τον χρήστη το διάστημα -m, m

# ζήτησε από τον χρήστη την τιμή του σπόρου seed

# δημιουργία λίστας τυχαίων αριθμών

# παρουσίαση της λίστας

# υπολογισμός μέγιστης απόστασης
