import numpy as np
import matplotlib.pyplot as plt
Foods=["Κοτόπουλο","Τυρί","Ρύζι"] #ΕΙδη Τροφών
Cost=[0.005, 0.01, 0.003] #Κόστος για κάθε Είδος Τροφής ανα γραμμάριο (Σύμφωνα με την προαναφερόμενη σειρά)
Ingredients=["Πρωτείνες","Υδατάνθρακες","Λιπαρά"] #Είδη Θρεπτικών Συστατικών
I1=[0.27,0.15,0.03] # Ποσσότητα προτείνης σε κάθε γραμμάριο των τριών τροφών (Σύμφωνα με την προαναφερόμενη σειρά)
I2=[0.01,0.02,0.28] # Ποσσότητα υδατάνθρακα σε κάθε γραμμάριο των τριών τροφών (Σύμφωνα με την προαναφερόμενη σειρά)
I3=[0.04,0.2,0.01] # Ποσσότητα λιπαρών σε κάθε γραμμάριο των τριών τροφών (Σύμφωνα με την προαναφερόμενη σειρά)
Daily_Consumption=[[90,150,60]] # Συνηστώμενη ημερίσια ποσσότητα σε γραμμάρια για κάθε Θρεπτικό Συστατικό (Σύμφωνα με την προαναφερόμενη σειρά)
Discount=[0.05, 0.1, 0.15]# Ποσσόστο έκπτωσης ανά κατάστημα

#Υπολογισμός απαραίτητης ποσσότητας από κάθε τροφή ημερισίως


# Υπολογισμός συνολικού κόστους και κόστους ανά τροφή


#Υπολογισμός έκπτωσης

    
#Γραφική Παράσταση κόστους σε συνάρτηση με ποιότητα κοτόπουλου
cost_sens=[4.701010101010101, 4.687575722046352, 4.674992431123221, 4.663181834855655, 4.652074880774432, 4.641610506307241, 4.63173451565229, 4.622398640922604, 4.613559753227755, 4.605179196481119]
A_sens=[0.27, 0.2781, 0.2862, 0.29430000000000006, 0.30240000000000006, 0.3105, 0.3186, 0.3267, 0.33480000000000004, 0.34290000000000004]




